---
kind: enumMember
id: F:Autodesk.Revit.DB.DataExchangeMessageId.UnexpectedResult
enum: Autodesk.Revit.DB.DataExchangeMessageId
source: html/f8f4737f-8c74-7c67-4669-ddddd2ccde1d.htm
---
# Autodesk.Revit.DB.DataExchangeMessageId.UnexpectedResult

Unexpected result produced by a data conversion operation. Conversion may continue, but the results should be carefully reviewed.